espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
/******************************************************************************
*  Filename:       hw_spi_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_SPI_H__
#define __HW_SPI_H__

//*****************************************************************************
//
// This section defines the register offsets of
// SPI component
//
//*****************************************************************************
// This register provides the highest priority enabled interrupt index. Value
// 0x00 means no event pending. Interrupt 1 is the highest priority, IIDX next
// highest, 4, 8, … IIDX^31 is the least priority. That is, the least bit
// position that is set to 1 denotes the highest priority pending interrupt.
// The priority order is fixed. However, users can implement their own
// prioritization schemes using other registers that expose the full set of
// interrupts that have occurred.
#define SPI_O_IIDX                                                  0x00000020

// Interrupt Mask. If a bit is set, then corresponding interrupt is un-masked.
// Un-masking the interrupt causes the raw interrupt to be visible in IIDX, as
// well as MIS.
#define SPI_O_IMASK                                                 0x00000028

// Raw interrupt status. Reflects all pending interrupts, regardless of
// masking. The RIS register allows the user to implement a poll scheme. A flag
// set in this register can be cleared by writing 1 to the ICLR register bit
// even if the corresponding IMASK bit is not enabled.
#define SPI_O_RIS                                                   0x00000030

// Masked interrupt status. This is an AND of the IMASK and RIS registers.
#define SPI_O_MIS                                                   0x00000038

// Interrupt set. Allows interrupts to be set by software (useful in
// diagnostics and safety checks). Writing a 1 to a bit in ISET will set the
// event and therefore the related RIS bit also gets set. If the interrupt is
// enabled through the mask, then the corresponding MIS bit is also set.
#define SPI_O_ISET                                                  0x00000040

// Interrupt clear. Write a 1 to clear corresponding Interrupt.
#define SPI_O_ICLR                                                  0x00000048

// Event mode register. It is used to select whether each line is disabled, in
// software mode (software clears the RIS) or in hardware mode (hardware clears
// the RIS)
#define SPI_O_EVT_MODE                                              0x000000E0

// This register identifies the peripheral and its exact version.
#define SPI_O_DESC                                                  0x000000FC

// SPI control register 0
#define SPI_O_CTL0                                                  0x00000100

// SPI control register 1
#define SPI_O_CTL1                                                  0x00000104

// Clock prescaler and divider register. This register contains the settings
// for the Clock prescaler and divider settings.
#define SPI_O_CLKCTL                                                0x00000108

// The IFLS register is the interrupt FIFO level select register. You can use
// this register to define the levels at which the TX, RX and timeout interrupt
// flags are triggered. The interrupts are generated based on a transition
// through a level rather than being based on the level. That is, the
// interrupts are generated when the fill level progresses through the trigger
// level. For example, if the receive trigger level is set to the half-way
// mark, the interrupt is triggered when the receive FIFO is filled with two or
// more characters. Out of reset, the TXIFLSEL and RXIFLSEL bits are configured
// so that the FIFOs trigger an interrupt at the half-way mark.
#define SPI_O_IFLS                                                  0x0000010C

// Status Register
#define SPI_O_STAT                                                  0x00000110

// This register is used to specify module-specific divide ratio of the
// functional clock.
#define SPI_O_CLKDIV2                                               0x00000114

// DMA Control Register
#define SPI_O_DMACR                                                 0x00000118

// RXDATA Register
#define SPI_O_RXDATA                                                0x00000130

// TXDATA Register
#define SPI_O_TXDATA                                                0x00000140

//*****************************************************************************
//
// Register: SPI_O_IIDX
//
//*****************************************************************************
// Field:   [7:0] STAT
//
// Interrupt index status
// ENUMs:
// DMA_DONE_TX_EVT          DMA Done for Transmit Event/interrupt pending
// DMA_DONE_RX_EVT          DMA Done for Receive Event/interrupt pending
// IDLE_EVT                 End of Transmit Event/interrupt pending
// TX_EMPTY                 Transmit Buffer Empty Event/interrupt pending
// TX_EVT                   Transmit Event/interrupt pending
// RX_EVT                   Receive Event/interrupt pending
// RTOUT_EVT                SPI receive time-out interrupt
// PER_EVT                  Transmit Parity Event/interrupt pending
// RXFIFO_OFV_EVT           RX FIFO Overflow Event/interrupt pending
// NO_INTR                  No interrupt pending
#define SPI_IIDX_STAT_W                                                      8
#define SPI_IIDX_STAT_M                                             0x000000FF
#define SPI_IIDX_STAT_S                                                      0
#define SPI_IIDX_STAT_DMA_DONE_TX_EVT                               0x00000009
#define SPI_IIDX_STAT_DMA_DONE_RX_EVT                               0x00000008
#define SPI_IIDX_STAT_IDLE_EVT                                      0x00000007
#define SPI_IIDX_STAT_TX_EMPTY                                      0x00000006
#define SPI_IIDX_STAT_TX_EVT                                        0x00000005
#define SPI_IIDX_STAT_RX_EVT                                        0x00000004
#define SPI_IIDX_STAT_RTOUT_EVT                                     0x00000003
#define SPI_IIDX_STAT_PER_EVT                                       0x00000002
#define SPI_IIDX_STAT_RXFIFO_OFV_EVT                                0x00000001
#define SPI_IIDX_STAT_NO_INTR                                       0x00000000

//*****************************************************************************
//
// Register: SPI_O_IMASK
//
//*****************************************************************************
// Field:     [8] DMA_DONE_TX
//
// DMA Done 1 event for TX event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_DMA_DONE_TX                                       0x00000100
#define SPI_IMASK_DMA_DONE_TX_BITN                                           8
#define SPI_IMASK_DMA_DONE_TX_M                                     0x00000100
#define SPI_IMASK_DMA_DONE_TX_S                                              8
#define SPI_IMASK_DMA_DONE_TX_SET                                   0x00000100
#define SPI_IMASK_DMA_DONE_TX_CLR                                   0x00000000

// Field:     [7] DMA_DONE_RX
//
// DMA Done 1 event for RX event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_DMA_DONE_RX                                       0x00000080
#define SPI_IMASK_DMA_DONE_RX_BITN                                           7
#define SPI_IMASK_DMA_DONE_RX_M                                     0x00000080
#define SPI_IMASK_DMA_DONE_RX_S                                              7
#define SPI_IMASK_DMA_DONE_RX_SET                                   0x00000080
#define SPI_IMASK_DMA_DONE_RX_CLR                                   0x00000000

// Field:     [6] IDLE
//
// SPI Idle event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_IDLE                                              0x00000040
#define SPI_IMASK_IDLE_BITN                                                  6
#define SPI_IMASK_IDLE_M                                            0x00000040
#define SPI_IMASK_IDLE_S                                                     6
#define SPI_IMASK_IDLE_SET                                          0x00000040
#define SPI_IMASK_IDLE_CLR                                          0x00000000

// Field:     [5] TXEMPTY
//
// Transmit FIFO Empty event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_TXEMPTY                                           0x00000020
#define SPI_IMASK_TXEMPTY_BITN                                               5
#define SPI_IMASK_TXEMPTY_M                                         0x00000020
#define SPI_IMASK_TXEMPTY_S                                                  5
#define SPI_IMASK_TXEMPTY_SET                                       0x00000020
#define SPI_IMASK_TXEMPTY_CLR                                       0x00000000

