espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:     [4] TX
//
// Transmit FIFO event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_TX                                                0x00000010
#define SPI_IMASK_TX_BITN                                                    4
#define SPI_IMASK_TX_M                                              0x00000010
#define SPI_IMASK_TX_S                                                       4
#define SPI_IMASK_TX_SET                                            0x00000010
#define SPI_IMASK_TX_CLR                                            0x00000000

// Field:     [3] RX
//
// Receive FIFO event. This interrupt is set if the selected Receive FIFO level
// has been reached
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_RX                                                0x00000008
#define SPI_IMASK_RX_BITN                                                    3
#define SPI_IMASK_RX_M                                              0x00000008
#define SPI_IMASK_RX_S                                                       3
#define SPI_IMASK_RX_SET                                            0x00000008
#define SPI_IMASK_RX_CLR                                            0x00000000

// Field:     [2] RTOUT
//
//  Enable SPI Receive Time-Out event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_RTOUT                                             0x00000004
#define SPI_IMASK_RTOUT_BITN                                                 2
#define SPI_IMASK_RTOUT_M                                           0x00000004
#define SPI_IMASK_RTOUT_S                                                    2
#define SPI_IMASK_RTOUT_SET                                         0x00000004
#define SPI_IMASK_RTOUT_CLR                                         0x00000000

// Field:     [1] PER
//
// Parity error event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_PER                                               0x00000002
#define SPI_IMASK_PER_BITN                                                   1
#define SPI_IMASK_PER_M                                             0x00000002
#define SPI_IMASK_PER_S                                                      1
#define SPI_IMASK_PER_SET                                           0x00000002
#define SPI_IMASK_PER_CLR                                           0x00000000

// Field:     [0] RXFIFO_OVF
//
// RXFIFO overflow event mask.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_IMASK_RXFIFO_OVF                                        0x00000001
#define SPI_IMASK_RXFIFO_OVF_BITN                                            0
#define SPI_IMASK_RXFIFO_OVF_M                                      0x00000001
#define SPI_IMASK_RXFIFO_OVF_S                                               0
#define SPI_IMASK_RXFIFO_OVF_SET                                    0x00000001
#define SPI_IMASK_RXFIFO_OVF_CLR                                    0x00000000

//*****************************************************************************
//
// Register: SPI_O_RIS
//
//*****************************************************************************
// Field:     [8] DMA_DONE_TX
//
// DMA Done 1 event for TX. This interrupt is set if the TX DMA channel sends
// the DONE signal. This allows the handling of the DMA event inside the mapped
// peripheral.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_DMA_DONE_TX                                         0x00000100
#define SPI_RIS_DMA_DONE_TX_BITN                                             8
#define SPI_RIS_DMA_DONE_TX_M                                       0x00000100
#define SPI_RIS_DMA_DONE_TX_S                                                8
#define SPI_RIS_DMA_DONE_TX_SET                                     0x00000100
#define SPI_RIS_DMA_DONE_TX_CLR                                     0x00000000

// Field:     [7] DMA_DONE_RX
//
// DMA Done 1 event for RX. This interrupt is set if the RX DMA channel sends
// the DONE signal. This allows the handling of the DMA event inside the mapped
// peripheral.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_DMA_DONE_RX                                         0x00000080
#define SPI_RIS_DMA_DONE_RX_BITN                                             7
#define SPI_RIS_DMA_DONE_RX_M                                       0x00000080
#define SPI_RIS_DMA_DONE_RX_S                                                7
#define SPI_RIS_DMA_DONE_RX_SET                                     0x00000080
#define SPI_RIS_DMA_DONE_RX_CLR                                     0x00000000

// Field:     [6] IDLE
//
// SPI has done finished transfers and changed into IDLE mode. This bit is set
// when BUSY goes low.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_IDLE                                                0x00000040
#define SPI_RIS_IDLE_BITN                                                    6
#define SPI_RIS_IDLE_M                                              0x00000040
#define SPI_RIS_IDLE_S                                                       6
#define SPI_RIS_IDLE_SET                                            0x00000040
#define SPI_RIS_IDLE_CLR                                            0x00000000

// Field:     [5] TXEMPTY
//
// Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the
// Transmit FIFO have been move to the shift register.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_TXEMPTY                                             0x00000020
#define SPI_RIS_TXEMPTY_BITN                                                 5
#define SPI_RIS_TXEMPTY_M                                           0x00000020
#define SPI_RIS_TXEMPTY_S                                                    5
#define SPI_RIS_TXEMPTY_SET                                         0x00000020
#define SPI_RIS_TXEMPTY_CLR                                         0x00000000

