espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:     [4] TX
//
// Transmit FIFO event. This interrupt is set if the selected Transmit FIFO
// level has been reached.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_TX                                                  0x00000010
#define SPI_RIS_TX_BITN                                                      4
#define SPI_RIS_TX_M                                                0x00000010
#define SPI_RIS_TX_S                                                         4
#define SPI_RIS_TX_SET                                              0x00000010
#define SPI_RIS_TX_CLR                                              0x00000000

// Field:     [3] RX
//
// Receive FIFO event. This interrupt is set if the selected Receive FIFO level
// has been reached
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_RX                                                  0x00000008
#define SPI_RIS_RX_BITN                                                      3
#define SPI_RIS_RX_M                                                0x00000008
#define SPI_RIS_RX_S                                                         3
#define SPI_RIS_RX_SET                                              0x00000008
#define SPI_RIS_RX_CLR                                              0x00000000

// Field:     [2] RTOUT
//
//  SPI Receive Time-Out event.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_RIS_RTOUT                                               0x00000004
#define SPI_RIS_RTOUT_BITN                                                   2
#define SPI_RIS_RTOUT_M                                             0x00000004
#define SPI_RIS_RTOUT_S                                                      2
#define SPI_RIS_RTOUT_SET                                           0x00000004
#define SPI_RIS_RTOUT_CLR                                           0x00000000

// Field:     [1] PER
//
// Parity error event: this bit is set if a Parity error has been detected
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_PER                                                 0x00000002
#define SPI_RIS_PER_BITN                                                     1
#define SPI_RIS_PER_M                                               0x00000002
#define SPI_RIS_PER_S                                                        1
#define SPI_RIS_PER_SET                                             0x00000002
#define SPI_RIS_PER_CLR                                             0x00000000

// Field:     [0] RXFIFO_OVF
//
// RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been
// detected.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_RIS_RXFIFO_OVF                                          0x00000001
#define SPI_RIS_RXFIFO_OVF_BITN                                              0
#define SPI_RIS_RXFIFO_OVF_M                                        0x00000001
#define SPI_RIS_RXFIFO_OVF_S                                                 0
#define SPI_RIS_RXFIFO_OVF_SET                                      0x00000001
#define SPI_RIS_RXFIFO_OVF_CLR                                      0x00000000

//*****************************************************************************
//
// Register: SPI_O_MIS
//
//*****************************************************************************
// Field:     [8] DMA_DONE_TX
//
// Masked DMA Done 1 event for TX.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_DMA_DONE_TX                                         0x00000100
#define SPI_MIS_DMA_DONE_TX_BITN                                             8
#define SPI_MIS_DMA_DONE_TX_M                                       0x00000100
#define SPI_MIS_DMA_DONE_TX_S                                                8
#define SPI_MIS_DMA_DONE_TX_SET                                     0x00000100
#define SPI_MIS_DMA_DONE_TX_CLR                                     0x00000000

// Field:     [7] DMA_DONE_RX
//
// Masked DMA Done 1 event for RX.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_DMA_DONE_RX                                         0x00000080
#define SPI_MIS_DMA_DONE_RX_BITN                                             7
#define SPI_MIS_DMA_DONE_RX_M                                       0x00000080
#define SPI_MIS_DMA_DONE_RX_S                                                7
#define SPI_MIS_DMA_DONE_RX_SET                                     0x00000080
#define SPI_MIS_DMA_DONE_RX_CLR                                     0x00000000

// Field:     [6] IDLE
//
// Masked SPI IDLE mode event.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_IDLE                                                0x00000040
#define SPI_MIS_IDLE_BITN                                                    6
#define SPI_MIS_IDLE_M                                              0x00000040
#define SPI_MIS_IDLE_S                                                       6
#define SPI_MIS_IDLE_SET                                            0x00000040
#define SPI_MIS_IDLE_CLR                                            0x00000000

// Field:     [5] TXEMPTY
//
// Masked Transmit FIFO Empty event.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_TXEMPTY                                             0x00000020
#define SPI_MIS_TXEMPTY_BITN                                                 5
#define SPI_MIS_TXEMPTY_M                                           0x00000020
#define SPI_MIS_TXEMPTY_S                                                    5
#define SPI_MIS_TXEMPTY_SET                                         0x00000020
#define SPI_MIS_TXEMPTY_CLR                                         0x00000000

