espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:     [4] TX
//
// Masked Transmit FIFO event. This interrupt is set if the selected Transmit
// FIFO level has been reached.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_TX                                                  0x00000010
#define SPI_MIS_TX_BITN                                                      4
#define SPI_MIS_TX_M                                                0x00000010
#define SPI_MIS_TX_S                                                         4
#define SPI_MIS_TX_SET                                              0x00000010
#define SPI_MIS_TX_CLR                                              0x00000000

// Field:     [3] RX
//
// Masked receive FIFO event. This interrupt is set if the selected Receive
// FIFO level has been reached
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_RX                                                  0x00000008
#define SPI_MIS_RX_BITN                                                      3
#define SPI_MIS_RX_M                                                0x00000008
#define SPI_MIS_RX_S                                                         3
#define SPI_MIS_RX_SET                                              0x00000008
#define SPI_MIS_RX_CLR                                              0x00000000

// Field:     [2] RTOUT
//
// Masked SPI Receive Time-Out Interrupt.
// ENUMs:
// SET                      Set Interrupt Mask
// CLR                      Clear Interrupt Mask
#define SPI_MIS_RTOUT                                               0x00000004
#define SPI_MIS_RTOUT_BITN                                                   2
#define SPI_MIS_RTOUT_M                                             0x00000004
#define SPI_MIS_RTOUT_S                                                      2
#define SPI_MIS_RTOUT_SET                                           0x00000004
#define SPI_MIS_RTOUT_CLR                                           0x00000000

// Field:     [1] PER
//
// Masked Parity error event: this bit if a Parity error has been detected
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_PER                                                 0x00000002
#define SPI_MIS_PER_BITN                                                     1
#define SPI_MIS_PER_M                                               0x00000002
#define SPI_MIS_PER_S                                                        1
#define SPI_MIS_PER_SET                                             0x00000002
#define SPI_MIS_PER_CLR                                             0x00000000

// Field:     [0] RXFIFO_OVF
//
// Masked RXFIFO overflow event. This interrupt is set if an RX FIFO overflow
// has been detected.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define SPI_MIS_RXFIFO_OVF                                          0x00000001
#define SPI_MIS_RXFIFO_OVF_BITN                                              0
#define SPI_MIS_RXFIFO_OVF_M                                        0x00000001
#define SPI_MIS_RXFIFO_OVF_S                                                 0
#define SPI_MIS_RXFIFO_OVF_SET                                      0x00000001
#define SPI_MIS_RXFIFO_OVF_CLR                                      0x00000000

//*****************************************************************************
//
// Register: SPI_O_ISET
//
//*****************************************************************************
// Field:     [8] DMA_DONE_TX
//
// Set DMA Done 1 event for TX.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_DMA_DONE_TX                                        0x00000100
#define SPI_ISET_DMA_DONE_TX_BITN                                            8
#define SPI_ISET_DMA_DONE_TX_M                                      0x00000100
#define SPI_ISET_DMA_DONE_TX_S                                               8
#define SPI_ISET_DMA_DONE_TX_SET                                    0x00000100
#define SPI_ISET_DMA_DONE_TX_NO_EFFECT                              0x00000000

// Field:     [7] DMA_DONE_RX
//
// Set DMA Done 1 event for RX.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_DMA_DONE_RX                                        0x00000080
#define SPI_ISET_DMA_DONE_RX_BITN                                            7
#define SPI_ISET_DMA_DONE_RX_M                                      0x00000080
#define SPI_ISET_DMA_DONE_RX_S                                               7
#define SPI_ISET_DMA_DONE_RX_SET                                    0x00000080
#define SPI_ISET_DMA_DONE_RX_NO_EFFECT                              0x00000000

// Field:     [6] IDLE
//
// Set SPI IDLE mode event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_IDLE                                               0x00000040
#define SPI_ISET_IDLE_BITN                                                   6
#define SPI_ISET_IDLE_M                                             0x00000040
#define SPI_ISET_IDLE_S                                                      6
#define SPI_ISET_IDLE_SET                                           0x00000040
#define SPI_ISET_IDLE_NO_EFFECT                                     0x00000000

// Field:     [5] TXEMPTY
//
// Set Transmit FIFO Empty event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_TXEMPTY                                            0x00000020
#define SPI_ISET_TXEMPTY_BITN                                                5
#define SPI_ISET_TXEMPTY_M                                          0x00000020
#define SPI_ISET_TXEMPTY_S                                                   5
#define SPI_ISET_TXEMPTY_SET                                        0x00000020
#define SPI_ISET_TXEMPTY_NO_EFFECT                                  0x00000000

