espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:     [4] TX
//
// Set Transmit FIFO event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_TX                                                 0x00000010
#define SPI_ISET_TX_BITN                                                     4
#define SPI_ISET_TX_M                                               0x00000010
#define SPI_ISET_TX_S                                                        4
#define SPI_ISET_TX_SET                                             0x00000010
#define SPI_ISET_TX_NO_EFFECT                                       0x00000000

// Field:     [3] RX
//
// Set Receive FIFO event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_RX                                                 0x00000008
#define SPI_ISET_RX_BITN                                                     3
#define SPI_ISET_RX_M                                               0x00000008
#define SPI_ISET_RX_S                                                        3
#define SPI_ISET_RX_SET                                             0x00000008
#define SPI_ISET_RX_NO_EFFECT                                       0x00000000

// Field:     [2] RTOUT
//
// Set SPI Receive Time-Out Event.
// ENUMs:
// SET                      Set Interrupt Mask
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_RTOUT                                              0x00000004
#define SPI_ISET_RTOUT_BITN                                                  2
#define SPI_ISET_RTOUT_M                                            0x00000004
#define SPI_ISET_RTOUT_S                                                     2
#define SPI_ISET_RTOUT_SET                                          0x00000004
#define SPI_ISET_RTOUT_NO_EFFECT                                    0x00000000

// Field:     [1] PER
//
// Set Parity error event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_PER                                                0x00000002
#define SPI_ISET_PER_BITN                                                    1
#define SPI_ISET_PER_M                                              0x00000002
#define SPI_ISET_PER_S                                                       1
#define SPI_ISET_PER_SET                                            0x00000002
#define SPI_ISET_PER_NO_EFFECT                                      0x00000000

// Field:     [0] RXFIFO_OVF
//
// Set RXFIFO overflow event.
// ENUMs:
// SET                      Set Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ISET_RXFIFO_OVF                                         0x00000001
#define SPI_ISET_RXFIFO_OVF_BITN                                             0
#define SPI_ISET_RXFIFO_OVF_M                                       0x00000001
#define SPI_ISET_RXFIFO_OVF_S                                                0
#define SPI_ISET_RXFIFO_OVF_SET                                     0x00000001
#define SPI_ISET_RXFIFO_OVF_NO_EFFECT                               0x00000000

//*****************************************************************************
//
// Register: SPI_O_ICLR
//
//*****************************************************************************
// Field:     [8] DMA_DONE_TX
//
// Clear DMA Done 1 event for TX.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_DMA_DONE_TX                                        0x00000100
#define SPI_ICLR_DMA_DONE_TX_BITN                                            8
#define SPI_ICLR_DMA_DONE_TX_M                                      0x00000100
#define SPI_ICLR_DMA_DONE_TX_S                                               8
#define SPI_ICLR_DMA_DONE_TX_CLR                                    0x00000100
#define SPI_ICLR_DMA_DONE_TX_NO_EFFECT                              0x00000000

// Field:     [7] DMA_DONE_RX
//
// Clear DMA Done 1 event for RX.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_DMA_DONE_RX                                        0x00000080
#define SPI_ICLR_DMA_DONE_RX_BITN                                            7
#define SPI_ICLR_DMA_DONE_RX_M                                      0x00000080
#define SPI_ICLR_DMA_DONE_RX_S                                               7
#define SPI_ICLR_DMA_DONE_RX_CLR                                    0x00000080
#define SPI_ICLR_DMA_DONE_RX_NO_EFFECT                              0x00000000

// Field:     [6] IDLE
//
// Clear SPI IDLE mode event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_IDLE                                               0x00000040
#define SPI_ICLR_IDLE_BITN                                                   6
#define SPI_ICLR_IDLE_M                                             0x00000040
#define SPI_ICLR_IDLE_S                                                      6
#define SPI_ICLR_IDLE_CLR                                           0x00000040
#define SPI_ICLR_IDLE_NO_EFFECT                                     0x00000000

// Field:     [5] TXEMPTY
//
// Clear Transmit FIFO Empty event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_TXEMPTY                                            0x00000020
#define SPI_ICLR_TXEMPTY_BITN                                                5
#define SPI_ICLR_TXEMPTY_M                                          0x00000020
#define SPI_ICLR_TXEMPTY_S                                                   5
#define SPI_ICLR_TXEMPTY_CLR                                        0x00000020
#define SPI_ICLR_TXEMPTY_NO_EFFECT                                  0x00000000

