espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:     [4] TX
//
// Clear Transmit FIFO event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_TX                                                 0x00000010
#define SPI_ICLR_TX_BITN                                                     4
#define SPI_ICLR_TX_M                                               0x00000010
#define SPI_ICLR_TX_S                                                        4
#define SPI_ICLR_TX_CLR                                             0x00000010
#define SPI_ICLR_TX_NO_EFFECT                                       0x00000000

// Field:     [3] RX
//
// Clear Receive FIFO event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_RX                                                 0x00000008
#define SPI_ICLR_RX_BITN                                                     3
#define SPI_ICLR_RX_M                                               0x00000008
#define SPI_ICLR_RX_S                                                        3
#define SPI_ICLR_RX_CLR                                             0x00000008
#define SPI_ICLR_RX_NO_EFFECT                                       0x00000000

// Field:     [2] RTOUT
//
// Clear SPI Receive Time-Out Event.
// ENUMs:
// CLR                      Set Interrupt Mask
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_RTOUT                                              0x00000004
#define SPI_ICLR_RTOUT_BITN                                                  2
#define SPI_ICLR_RTOUT_M                                            0x00000004
#define SPI_ICLR_RTOUT_S                                                     2
#define SPI_ICLR_RTOUT_CLR                                          0x00000004
#define SPI_ICLR_RTOUT_NO_EFFECT                                    0x00000000

// Field:     [1] PER
//
// Clear Parity error event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_PER                                                0x00000002
#define SPI_ICLR_PER_BITN                                                    1
#define SPI_ICLR_PER_M                                              0x00000002
#define SPI_ICLR_PER_S                                                       1
#define SPI_ICLR_PER_CLR                                            0x00000002
#define SPI_ICLR_PER_NO_EFFECT                                      0x00000000

// Field:     [0] RXFIFO_OVF
//
// Clear RXFIFO overflow event.
// ENUMs:
// CLR                      Clear Interrupt
// NO_EFFECT                Writing 0 has no effect
#define SPI_ICLR_RXFIFO_OVF                                         0x00000001
#define SPI_ICLR_RXFIFO_OVF_BITN                                             0
#define SPI_ICLR_RXFIFO_OVF_M                                       0x00000001
#define SPI_ICLR_RXFIFO_OVF_S                                                0
#define SPI_ICLR_RXFIFO_OVF_CLR                                     0x00000001
#define SPI_ICLR_RXFIFO_OVF_NO_EFFECT                               0x00000000

//*****************************************************************************
//
// Register: SPI_O_EVT_MODE
//
//*****************************************************************************
// Field:   [1:0] INT0_CFG
//
// Event line mode select for event corresponding to IPSTANDARD.INT_EVENT0
// ENUMs:
// HARDWARE                 The interrupt or event line is in hardware mode.
//                          The hardware (another module) clears
//                          automatically the associated RIS flag.
// SOFTWARE                 The interrupt or event line is in software mode.
//                          Software must clear the RIS.
// DISABLE                  The interrupt or event line is disabled.
#define SPI_EVT_MODE_INT0_CFG_W                                              2
#define SPI_EVT_MODE_INT0_CFG_M                                     0x00000003
#define SPI_EVT_MODE_INT0_CFG_S                                              0
#define SPI_EVT_MODE_INT0_CFG_HARDWARE                              0x00000002
#define SPI_EVT_MODE_INT0_CFG_SOFTWARE                              0x00000001
#define SPI_EVT_MODE_INT0_CFG_DISABLE                               0x00000000

//*****************************************************************************
//
// Register: SPI_O_DESC
//
//*****************************************************************************
// Field: [31:16] MODULEID
//
// Module identification contains a unique peripheral identification number.
// The assignments are maintained in a central database for all of the platform
// modules to ensure uniqueness.
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_DESC_MODULEID_W                                                 16
#define SPI_DESC_MODULEID_M                                         0xFFFF0000
#define SPI_DESC_MODULEID_S                                                 16
#define SPI_DESC_MODULEID_MAXIMUM                                   0xFFFF0000
#define SPI_DESC_MODULEID_MINIMUM                                   0x00000000

// Field: [15:12] FEATUREVER
//
// Feature Set for the module *instance*
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_DESC_FEATUREVER_W                                                4
#define SPI_DESC_FEATUREVER_M                                       0x0000F000
#define SPI_DESC_FEATUREVER_S                                               12
#define SPI_DESC_FEATUREVER_MAXIMUM                                 0x0000F000
#define SPI_DESC_FEATUREVER_MINIMUM                                 0x00000000

// Field:   [7:4] MAJREV
//
// Major rev of the IP
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_DESC_MAJREV_W                                                    4
#define SPI_DESC_MAJREV_M                                           0x000000F0
#define SPI_DESC_MAJREV_S                                                    4
#define SPI_DESC_MAJREV_MAXIMUM                                     0x000000F0
#define SPI_DESC_MAJREV_MINIMUM                                     0x00000000

// Field:   [3:0] MINREV
//
// Minor rev of the IP
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_DESC_MINREV_W                                                    4
#define SPI_DESC_MINREV_M                                           0x0000000F
#define SPI_DESC_MINREV_S                                                    0
#define SPI_DESC_MINREV_MAXIMUM                                     0x0000000F
#define SPI_DESC_MINREV_MINIMUM                                     0x00000000

//*****************************************************************************
//
// Register: SPI_O_CTL0
//
//*****************************************************************************
// Field:    [14] CSCLR
//
// Clear shift register counter on CS inactive
// This bit is relevant only in the slave mode, MS=0.
// 0: The shift counter will keep its state when CS goes low
// 1: The shift counter will be clear when CS goes low
// ENUMs:
// ENABLE                   Enable automatic clear of shift register when CS
//                          goes to disable.
// DISABLE                  Disable automatic clear of shift register when CS
//                          goes to disable.
#define SPI_CTL0_CSCLR                                              0x00004000
#define SPI_CTL0_CSCLR_BITN                                                 14
#define SPI_CTL0_CSCLR_M                                            0x00004000
#define SPI_CTL0_CSCLR_S                                                    14
#define SPI_CTL0_CSCLR_ENABLE                                       0x00004000
#define SPI_CTL0_CSCLR_DISABLE                                      0x00000000

// Field:     [9] SPH
//
// CLKOUT phase (Motorola SPI frame format only)
// This bit selects the clock edge that captures data and enables it to change
// state. It
// has the most impact on the first bit transmitted by either permitting or not
// permitting a clock transition before the first data capture edge.
// 0h = 1ST_CLK_EDGE : Data is captured on the first clock edge transition.
// 1h = 2ND_CLK_EDGE : Data is captured on the second clock edge transition.
// ENUMs:
// SECOND                   Data is captured on the second clock edge
//                          transition.
// FIRST                    Data is captured on the first clock edge
//                          transition.
#define SPI_CTL0_SPH                                                0x00000200
#define SPI_CTL0_SPH_BITN                                                    9
#define SPI_CTL0_SPH_M                                              0x00000200
#define SPI_CTL0_SPH_S                                                       9
#define SPI_CTL0_SPH_SECOND                                         0x00000200
#define SPI_CTL0_SPH_FIRST                                          0x00000000

// Field:     [8] SPO
//
// CLKOUT polarity (Motorola SPI frame format only)
// 0h = SPI produces a steady state LOW value on the CLKOUT pin when data is
// not being transferred.
// 1h = SPI produces a steady state HIGH value on the CLKOUT pin when data is
// not being transferred.
// ENUMs:
// HIGH                     SPI produces a steady state HIGH value on the
//                          CLKOUT
// LOW                      SPI produces a steady state LOW value on the
//                          CLKOUT
#define SPI_CTL0_SPO                                                0x00000100
#define SPI_CTL0_SPO_BITN                                                    8
#define SPI_CTL0_SPO_M                                              0x00000100
#define SPI_CTL0_SPO_S                                                       8
#define SPI_CTL0_SPO_HIGH                                           0x00000100
#define SPI_CTL0_SPO_LOW                                            0x00000000

// Field:   [6:5] FRF
//
// Frame format Select
// ENUMs:
// MIRCOWIRE                National Microwire frame format
// TI_SYNC                  TI synchronous serial frame format
// MOTOROLA_4WIRE           Motorola SPI frame format (4 wire mode)
// MOTOROLA_3WIRE           Motorola SPI frame format (3 wire mode)
#define SPI_CTL0_FRF_W                                                       2
#define SPI_CTL0_FRF_M                                              0x00000060
#define SPI_CTL0_FRF_S                                                       5
#define SPI_CTL0_FRF_MIRCOWIRE                                      0x00000060
#define SPI_CTL0_FRF_TI_SYNC                                        0x00000040
#define SPI_CTL0_FRF_MOTOROLA_4WIRE                                 0x00000020
#define SPI_CTL0_FRF_MOTOROLA_3WIRE                                 0x00000000

// Field:   [4:0] DSS
//
// Data Size Select.
// Note:
// Master mode: Values 0 - 2 are reserved and shall not be used. This will map
// to 4 bit  mode. 3h = 4_BIT : 4-bit data
// Slave mode: DSS should be no less than 6 which means the minimum frame
// length is 7 bits.
// ENUMs:
// DSS_32                   Data Size Select bits: 32
// DSS_31                   Data Size Select bits: 31
// DSS_30                   Data Size Select bits: 30
// DSS_29                   Data Size Select bits: 29
// DSS_28                   Data Size Select bits: 28
// DSS_27                   Data Size Select bits: 27
// DSS_26                   Data Size Select bits: 26
// DSS_25                   Data Size Select bits: 25
// DSS_24                   Data Size Select bits: 24
// DSS_23                   Data Size Select bits: 23
// DSS_22                   Data Size Select bits: 22
// DSS_21                   Data Size Select bits: 21
// DSS_20                   Data Size Select bits: 20
// DSS_19                   Data Size Select bits: 19
// DSS_18                   Data Size Select bits: 18
// DSS_17                   Data Size Select bits: 17
// DSS_16                   Data Size Select bits: 16
// DSS_15                   Data Size Select bits: 15
// DSS_14                   Data Size Select bits: 14
// DSS_13                   Data Size Select bits: 13
// DSS_12                   Data Size Select bits: 12
// DSS_11                   Data Size Select bits: 11
// DSS_10                   Data Size Select bits: 10
// DSS_9                    Data Size Select bits: 9
// DSS_8                    Data Size Select bits: 8
// DSS_7                    Data Size Select bits: 7
// DSS_6                    Data Size Select bits: 6
// DSS_5                    Data Size Select bits: 5
// DSS_4                    Data Size Select bits: 4
#define SPI_CTL0_DSS_W                                                       5
#define SPI_CTL0_DSS_M                                              0x0000001F
#define SPI_CTL0_DSS_S                                                       0
#define SPI_CTL0_DSS_DSS_32                                         0x0000001F
#define SPI_CTL0_DSS_DSS_31                                         0x0000001E
#define SPI_CTL0_DSS_DSS_30                                         0x0000001D
#define SPI_CTL0_DSS_DSS_29                                         0x0000001C
#define SPI_CTL0_DSS_DSS_28                                         0x0000001B
#define SPI_CTL0_DSS_DSS_27                                         0x0000001A
#define SPI_CTL0_DSS_DSS_26                                         0x00000019
#define SPI_CTL0_DSS_DSS_25                                         0x00000018
#define SPI_CTL0_DSS_DSS_24                                         0x00000017
#define SPI_CTL0_DSS_DSS_23                                         0x00000016
#define SPI_CTL0_DSS_DSS_22                                         0x00000015
#define SPI_CTL0_DSS_DSS_21                                         0x00000014
#define SPI_CTL0_DSS_DSS_20                                         0x00000013
#define SPI_CTL0_DSS_DSS_19                                         0x00000012
#define SPI_CTL0_DSS_DSS_18                                         0x00000011
#define SPI_CTL0_DSS_DSS_17                                         0x00000010
#define SPI_CTL0_DSS_DSS_16                                         0x0000000F
#define SPI_CTL0_DSS_DSS_15                                         0x0000000E
#define SPI_CTL0_DSS_DSS_14                                         0x0000000D
#define SPI_CTL0_DSS_DSS_13                                         0x0000000C
#define SPI_CTL0_DSS_DSS_12                                         0x0000000B
#define SPI_CTL0_DSS_DSS_11                                         0x0000000A
#define SPI_CTL0_DSS_DSS_10                                         0x00000009
#define SPI_CTL0_DSS_DSS_9                                          0x00000008
#define SPI_CTL0_DSS_DSS_8                                          0x00000007
#define SPI_CTL0_DSS_DSS_7                                          0x00000006
#define SPI_CTL0_DSS_DSS_6                                          0x00000005
#define SPI_CTL0_DSS_DSS_5                                          0x00000004
#define SPI_CTL0_DSS_DSS_4                                          0x00000003

//*****************************************************************************
//
// Register: SPI_O_CTL1
//
//*****************************************************************************
// Field: [29:24] RXTIMEOUT
//
// Receive Timeout (only for Slave mode)
// Defines the number of Clock Cycles before after which the Receive Timeout
// flag RTOUT is set.
// The time is calculated using the control register for the clock selection
// and divider in the Master mode configuration.
// A value of 0 disables this function.
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_CTL1_RXTIMEOUT_W                                                 6
#define SPI_CTL1_RXTIMEOUT_M                                        0x3F000000
#define SPI_CTL1_RXTIMEOUT_S                                                24
#define SPI_CTL1_RXTIMEOUT_MAXIMUM                                  0x3F000000
#define SPI_CTL1_RXTIMEOUT_MINIMUM                                  0x00000000

// Field: [23:16] REPEATTX
//
// Counter to repeat last transfer
// 0: repeat last transfer is disabled.
// x: repeat the last transfer with the given number.
// The transfer will be started with writing a data into the TX Buffer. Sending
// the data will be repeated with the given value, so the data will be
// transferred X+1 times in total.
// The behavior is identical as if the data would be written into the TX Buffer
// that many times as defined by the value here.
// It can be used to clean a transfer or to pull a certain amount of data by a
// slave.
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_CTL1_REPEATTX_W                                                  8
#define SPI_CTL1_REPEATTX_M                                         0x00FF0000
#define SPI_CTL1_REPEATTX_S                                                 16
#define SPI_CTL1_REPEATTX_MAXIMUM                                   0x00FF0000
#define SPI_CTL1_REPEATTX_MINIMUM                                   0x00000000

