espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:   [9:8] MODE
//
// SPI Communication Mode Select
// Note: Reserved/undefined Modes are identical to Legacy mode. MultiSPI mode
// is not supported
// ENUMs:
// MULTISPI4                multiSPI Mode with 4 Data Bits (not supported)
// MULTISPI2                multiSPI Mode with 2 Data Bits (not supported)
// LEGACY                   Legacy Mode
#define SPI_CTL1_MODE_W                                                      2
#define SPI_CTL1_MODE_M                                             0x00000300
#define SPI_CTL1_MODE_S                                                      8
#define SPI_CTL1_MODE_MULTISPI4                                     0x00000300
#define SPI_CTL1_MODE_MULTISPI2                                     0x00000200
#define SPI_CTL1_MODE_LEGACY                                        0x00000000

// Field:     [7] PBS
//
// Parity Bit Select:
// Disabled: Bit 0 is used for Parity
// Enabled: Bit 1 is used for Parity, Bit 0 is ignored
// ENUMs:
// ENABLE                   Bit 1 is used for Parity, Bit 0 is ignored
// DISABLE                  Bit 0 is used for Parity
#define SPI_CTL1_PBS                                                0x00000080
#define SPI_CTL1_PBS_BITN                                                    7
#define SPI_CTL1_PBS_M                                              0x00000080
#define SPI_CTL1_PBS_S                                                       7
#define SPI_CTL1_PBS_ENABLE                                         0x00000080
#define SPI_CTL1_PBS_DISABLE                                        0x00000000

// Field:     [6] PES
//
// Even Parity Select
// ENUMs:
// ENABLE                   Even Parity mode
// DISABLE                  Odd Parity mode
#define SPI_CTL1_PES                                                0x00000040
#define SPI_CTL1_PES_BITN                                                    6
#define SPI_CTL1_PES_M                                              0x00000040
#define SPI_CTL1_PES_S                                                       6
#define SPI_CTL1_PES_ENABLE                                         0x00000040
#define SPI_CTL1_PES_DISABLE                                        0x00000000

// Field:     [5] PEN
//
// Parity enable
// if enabled the last bit will be used as parity to evaluate the right
// transmission of the previous bits.
// In case of a parity miss-match the parity error flag RIS.PER will be set.
// ENUMs:
// ENABLE                   Enable Parity function
// DISABLE                  Disable Parity function
#define SPI_CTL1_PEN                                                0x00000020
#define SPI_CTL1_PEN_BITN                                                    5
#define SPI_CTL1_PEN_M                                              0x00000020
#define SPI_CTL1_PEN_S                                                       5
#define SPI_CTL1_PEN_ENABLE                                         0x00000020
#define SPI_CTL1_PEN_DISABLE                                        0x00000000

// Field:     [4] MSB
//
// MSB first select. Controls the direction of the receive and transmit shift
// register.
// 0b = LSB first
// 1b = MSB first
// ENUMs:
// ENABLE                   MSB first
// DISABLE                  LSB first
#define SPI_CTL1_MSB                                                0x00000010
#define SPI_CTL1_MSB_BITN                                                    4
#define SPI_CTL1_MSB_M                                              0x00000010
#define SPI_CTL1_MSB_S                                                       4
#define SPI_CTL1_MSB_ENABLE                                         0x00000010
#define SPI_CTL1_MSB_DISABLE                                        0x00000000

// Field:     [3] SOD
//
// Slave-mode: Data output disabled
// This bit is relevant only in the slave mode, MS=0. In multiple-slave
// systems, it is possible for an SPI master to broadcast a message to all
// slaves in the system while ensuring that only one slave drives data onto its
// serial output line. In such systems the RXD lines from multiple slaves could
// be tied together. To operate in such systems, this bitfield can be set if
// the SPI slave is not supposed to drive the TXD line:
// 0: SPI can drive the MISO output in slave mode.
// 1: SPI cannot drive the MISO output in slave mode.
// ENUMs:
// ENABLE                   SPI cannot drive the MISO output in slave mode.
// DISABLE                  SPI can drive the MISO output in slave mode.
#define SPI_CTL1_SOD                                                0x00000008
#define SPI_CTL1_SOD_BITN                                                    3
#define SPI_CTL1_SOD_M                                              0x00000008
#define SPI_CTL1_SOD_S                                                       3
#define SPI_CTL1_SOD_ENABLE                                         0x00000008
#define SPI_CTL1_SOD_DISABLE                                        0x00000000

// Field:     [2] MS
//
// Master or slave mode select. This bit can be modified only when SPI is
// disabled, CTL1.ENABLE=0.
// 0h = Device configured as slave
// 1h = Device configured as master
// ENUMs:
// ENABLE                   Select Master Mode
// DISABLE                  Select Slave Mode
#define SPI_CTL1_MS                                                 0x00000004
#define SPI_CTL1_MS_BITN                                                     2
#define SPI_CTL1_MS_M                                               0x00000004
#define SPI_CTL1_MS_S                                                        2
#define SPI_CTL1_MS_ENABLE                                          0x00000004
#define SPI_CTL1_MS_DISABLE                                         0x00000000

// Field:     [1] LBM
//
// Loop back mode:
// 0: Normal serial port operation enabled.
// 1: Output of transmit serial shifter is connected to input of receive serial
// shifter internally.
// ENUMs:
// ENABLE                   Enable loopback mode
// DISABLE                  Disable loopback mode
#define SPI_CTL1_LBM                                                0x00000002
#define SPI_CTL1_LBM_BITN                                                    1
#define SPI_CTL1_LBM_M                                              0x00000002
#define SPI_CTL1_LBM_S                                                       1
#define SPI_CTL1_LBM_ENABLE                                         0x00000002
#define SPI_CTL1_LBM_DISABLE                                        0x00000000

// Field:     [0] ENABLE
//
// SPI enable
// 0b = Disabled. SPI is disabled and logic held in reset state.
// 1b = Enabled. SPI  released for operation.
// ENUMs:
// ENABLE                   Enable module function
// DISABLE                  Disable module function
#define SPI_CTL1_ENABLE                                             0x00000001
#define SPI_CTL1_ENABLE_BITN                                                 0
#define SPI_CTL1_ENABLE_M                                           0x00000001
#define SPI_CTL1_ENABLE_S                                                    0
#define SPI_CTL1_ENABLE_ENABLE                                      0x00000001
#define SPI_CTL1_ENABLE_DISABLE                                     0x00000000

//*****************************************************************************
//
// Register: SPI_O_CLKCTL
//
//*****************************************************************************
// Field: [31:28] DSAMPLE
//
// Delayed sampling. In master mode the data on the input pin will be delayed
// sampled by the defined clock cycles.
// Note: As an example, if the SPI transmit frequency is set to 12 MHz  in the
// master mode, DSAMPLE should be set to a value of 2
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_CLKCTL_DSAMPLE_W                                                 4
#define SPI_CLKCTL_DSAMPLE_M                                        0xF0000000
#define SPI_CLKCTL_DSAMPLE_S                                                28
#define SPI_CLKCTL_DSAMPLE_MAXIMUM                                  0xF0000000
#define SPI_CLKCTL_DSAMPLE_MINIMUM                                  0x00000000

