espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_spi.h
// Field:   [9:0] SCR
//
// Serial clock divider:
// This is used to generate the transmit and receive bit rate of the SPI.
// The SPI bit rate is
// (SPI's functional clock frequency)/((SCR+1)*2).
// SCR is a value from 0-1023.
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define SPI_CLKCTL_SCR_W                                                    10
#define SPI_CLKCTL_SCR_M                                            0x000003FF
#define SPI_CLKCTL_SCR_S                                                     0
#define SPI_CLKCTL_SCR_MAXIMUM                                      0x000003FF
#define SPI_CLKCTL_SCR_MINIMUM                                      0x00000000

//*****************************************************************************
//
// Register: SPI_O_IFLS
//
//*****************************************************************************
// Field:   [5:3] RXIFLSEL
//
// SPI Receive Interrupt FIFO Level Select  The trigger points for the receive
// interrupt are as follows:
// ENUMs:
// LEVEL_1                  Trigger when RX FIFO contains >= 1 byte
//                          Should be used with DMA
// LVL_RES6                 Reserved
// LVL_FULL                 RX FIFO is full
// LVL_RES4                 Reserved
// LVL_3_4                  RX FIFO >= 3/4 full
// LVL_1_2                  RX FIFO >= 1/2 full (default)
// LVL_1_4                  RX FIFO >= 1/4 full
// LVL_OFF                  Reserved
#define SPI_IFLS_RXIFLSEL_W                                                  3
#define SPI_IFLS_RXIFLSEL_M                                         0x00000038
#define SPI_IFLS_RXIFLSEL_S                                                  3
#define SPI_IFLS_RXIFLSEL_LEVEL_1                                   0x00000038
#define SPI_IFLS_RXIFLSEL_LVL_RES6                                  0x00000030
#define SPI_IFLS_RXIFLSEL_LVL_FULL                                  0x00000028
#define SPI_IFLS_RXIFLSEL_LVL_RES4                                  0x00000020
#define SPI_IFLS_RXIFLSEL_LVL_3_4                                   0x00000018
#define SPI_IFLS_RXIFLSEL_LVL_1_2                                   0x00000010
#define SPI_IFLS_RXIFLSEL_LVL_1_4                                   0x00000008
#define SPI_IFLS_RXIFLSEL_LVL_OFF                                   0x00000000

// Field:   [2:0] TXIFLSEL
//
// SPI Transmit Interrupt FIFO Level Select  The trigger points for the
// transmit interrupt are as follows:
// ENUMs:
// LEVEL_1                  Trigger when TX FIFO has >= 1 byte free
//                          Should be used with DMA
// LVL_RES6                 Reserved
// LVL_EMPTY                TX FIFO is empty
// LVL_RES4                 Reserved
// LVL_1_4                  TX FIFO <= 1/4 empty
// LVL_1_2                  TX FIFO <= 1/2 empty (default)
// LVL_3_4                  TX FIFO <= 3/4 empty
// LVL_OFF                  Reserved
#define SPI_IFLS_TXIFLSEL_W                                                  3
#define SPI_IFLS_TXIFLSEL_M                                         0x00000007
#define SPI_IFLS_TXIFLSEL_S                                                  0
#define SPI_IFLS_TXIFLSEL_LEVEL_1                                   0x00000007
#define SPI_IFLS_TXIFLSEL_LVL_RES6                                  0x00000006
#define SPI_IFLS_TXIFLSEL_LVL_EMPTY                                 0x00000005
#define SPI_IFLS_TXIFLSEL_LVL_RES4                                  0x00000004
#define SPI_IFLS_TXIFLSEL_LVL_1_4                                   0x00000003
#define SPI_IFLS_TXIFLSEL_LVL_1_2                                   0x00000002
#define SPI_IFLS_TXIFLSEL_LVL_3_4                                   0x00000001
#define SPI_IFLS_TXIFLSEL_LVL_OFF                                   0x00000000

//*****************************************************************************
//
// Register: SPI_O_STAT
//
//*****************************************************************************
// Field:     [4] BUSY
//
// Busy
// ENUMs:
// ACTIVE                   SPI is currently transmitting and/or receiving
//                          data, or transmit FIFO is not empty.
// IDLE                     SPI is in idle mode.
#define SPI_STAT_BUSY                                               0x00000010
#define SPI_STAT_BUSY_BITN                                                   4
#define SPI_STAT_BUSY_M                                             0x00000010
#define SPI_STAT_BUSY_S                                                      4
#define SPI_STAT_BUSY_ACTIVE                                        0x00000010
#define SPI_STAT_BUSY_IDLE                                          0x00000000

// Field:     [3] RNF
//
// Receive FIFO not full
// ENUMs:
// NOT_FULL                 Receive FIFO is not full.
// FULL                     Receive FIFO is full.
#define SPI_STAT_RNF                                                0x00000008
#define SPI_STAT_RNF_BITN                                                    3
#define SPI_STAT_RNF_M                                              0x00000008
#define SPI_STAT_RNF_S                                                       3
#define SPI_STAT_RNF_NOT_FULL                                       0x00000008
#define SPI_STAT_RNF_FULL                                           0x00000000

// Field:     [2] RFE
//
// Receive FIFO empty.
// ENUMs:
// EMPTY                    Receive FIFO is empty.
// NOT_EMPTY                Receive FIFO is not empty.
#define SPI_STAT_RFE                                                0x00000004
#define SPI_STAT_RFE_BITN                                                    2
#define SPI_STAT_RFE_M                                              0x00000004
#define SPI_STAT_RFE_S                                                       2
#define SPI_STAT_RFE_EMPTY                                          0x00000004
#define SPI_STAT_RFE_NOT_EMPTY                                      0x00000000

// Field:     [1] TNF
//
// Transmit FIFI not full
// ENUMs:
// NOT_FULL                 Transmit FIFO is not full.
// FULL                     Transmit FIFO is full.
#define SPI_STAT_TNF                                                0x00000002
#define SPI_STAT_TNF_BITN                                                    1
#define SPI_STAT_TNF_M                                              0x00000002
#define SPI_STAT_TNF_S                                                       1
#define SPI_STAT_TNF_NOT_FULL                                       0x00000002
#define SPI_STAT_TNF_FULL                                           0x00000000

// Field:     [0] TFE
//
// Transmit FIFO empty.
// ENUMs:
// EMPTY                    Transmit FIFO is empty.
// NOT_EMPTY                Transmit FIFO is not empty.
#define SPI_STAT_TFE                                                0x00000001
#define SPI_STAT_TFE_BITN                                                    0
#define SPI_STAT_TFE_M                                              0x00000001
#define SPI_STAT_TFE_S                                                       0
#define SPI_STAT_TFE_EMPTY                                          0x00000001
#define SPI_STAT_TFE_NOT_EMPTY                                      0x00000000

//*****************************************************************************
//
// Register: SPI_O_CLKDIV2
//
//*****************************************************************************
// Field:   [2:0] RATIO
//
// Selects divide ratio of module clock
// ENUMs:
// DIV_BY_8                 Divide clock source by 8
// DIV_BY_7                 Divide clock source by 7
// DIV_BY_6                 Divide clock source by 6
// DIV_BY_5                 Divide clock source by 5
// DIV_BY_4                 Divide clock source by 4
// DIV_BY_3                 Divide clock source by 3
// DIV_BY_2                 Divide clock source by 2
// DIV_BY_1                 Do not divide clock source
#define SPI_CLKDIV2_RATIO_W                                                  3
#define SPI_CLKDIV2_RATIO_M                                         0x00000007
#define SPI_CLKDIV2_RATIO_S                                                  0
#define SPI_CLKDIV2_RATIO_DIV_BY_8                                  0x00000007
#define SPI_CLKDIV2_RATIO_DIV_BY_7                                  0x00000006
#define SPI_CLKDIV2_RATIO_DIV_BY_6                                  0x00000005
#define SPI_CLKDIV2_RATIO_DIV_BY_5                                  0x00000004
#define SPI_CLKDIV2_RATIO_DIV_BY_4                                  0x00000003
#define SPI_CLKDIV2_RATIO_DIV_BY_3                                  0x00000002
#define SPI_CLKDIV2_RATIO_DIV_BY_2                                  0x00000001
#define SPI_CLKDIV2_RATIO_DIV_BY_1                                  0x00000000

//*****************************************************************************
//
// Register: SPI_O_DMACR
//
//*****************************************************************************
// Field:     [1] TXDMAE
//
// Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is
// enabled.
#define SPI_DMACR_TXDMAE                                            0x00000002
#define SPI_DMACR_TXDMAE_BITN                                                1
#define SPI_DMACR_TXDMAE_M                                          0x00000002
#define SPI_DMACR_TXDMAE_S                                                   1

// Field:     [0] RXDMAE
//
// Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is
// enabled.
#define SPI_DMACR_RXDMAE                                            0x00000001
#define SPI_DMACR_RXDMAE_BITN                                                0
#define SPI_DMACR_RXDMAE_M                                          0x00000001
#define SPI_DMACR_RXDMAE_S                                                   0

//*****************************************************************************
//
// Register: SPI_O_RXDATA
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// Received Data
// Core Domain SPI: 32-bits wide data register
// ULL Domain SPI: 16-bits wide data register
// When read, the entry in the receive FIFO, pointed to by the current FIFO
// read pointer, is accessed. As data values are removed by the receive logic
// from the incoming data frame, they are placed into the entry in the receive
// FIFO, pointed to by the current FIFO write pointer.
// Received data less than 16 bits is automatically right justified in the
// receive buffer.
// ENUMs:
// MAXIMUM                  Highest possible value
// MAX16BIT                 Highest possible value
// MINIMUM                  Smallest value
#define SPI_RXDATA_DATA_W                                                   32
#define SPI_RXDATA_DATA_M                                           0xFFFFFFFF
#define SPI_RXDATA_DATA_S                                                    0
#define SPI_RXDATA_DATA_MAXIMUM                                     0xFFFFFFFF
#define SPI_RXDATA_DATA_MAX16BIT                                    0x0000FFFF
#define SPI_RXDATA_DATA_MINIMUM                                     0x00000000

//*****************************************************************************
//
// Register: SPI_O_TXDATA
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// Transmit Data
// 32-bits wide data register:
// When read, the last entry in the transmit FIFO, pointed to by the current
// FIFO write pointer, is accessed.
// When written, the entry in the transmit FIFO, pointed to by the write
// pointer, is written to. Data values are removed from the transmit FIFO one
// value at a time by the transmit logic. It is loaded into the transmit serial
// shifter, then serially shifted out onto the TXD output pin at the programmed
// bit rate.
// When a data size of less than 32 bits is selected, the user must
// right-justify data written to the transmit FIFO. The transmit logic ignores
// the unused bits.
// ENUMs:
// MAXIMUM                  Highest possible value
// MAX16BIT                 Highest possible value
// MINIMUM                  Smallest value
#define SPI_TXDATA_DATA_W                                                   32
#define SPI_TXDATA_DATA_M                                           0xFFFFFFFF
#define SPI_TXDATA_DATA_S                                                    0
#define SPI_TXDATA_DATA_MAXIMUM                                     0xFFFFFFFF
#define SPI_TXDATA_DATA_MAX16BIT                                    0x0000FFFF
#define SPI_TXDATA_DATA_MINIMUM                                     0x00000000


#endif // __SPI__
